vinaib/arm_asm/m/st/STM32CubeIDE 1.2.0_Workspace/006_STM32F446RE_DRIVERS/Drivers/src/stm32f446re_i2c.c
/*
 * stm32f466re_i2c.c
 *
 *  Created on: 06-May-2020
 *      Author: GAYATHRI
 */
#include<stddef.h>
#include<stm32f446re_rcc.h>
#include <stm32f446re_i2c.h>

/*
 *  STATIC FUNCTIONS
 */

/* ****************************************************************************************
* @fn 				- I2C_Generate_Start_condition
*
* @breif			-
*
* @param[in]		-
* @param[in]		-
* @param[in]		-
*
* @return			- none
*
* @note				- none
**/
static void I2C_Generate_Start_condition(I2C_RegDef_t *pI2Cx)
{
	pI2Cx->CR1 |= (1 << I2C_CR1_START);
}

/* ****************************************************************************************
* @fn 				- I2C_ExecuteAddressPhaseWrite
*
* @breif			-
*
* @param[in]		-
* @param[in]		-
* @param[in]		-
*
* @return			- none
*
* @note				- none
**/
static void I2C_ExecuteAddressPhaseWrite(I2C_RegDef_t *pI2Cx, uint8_t slaveAddr)
{
	slaveAddr |= (slaveAddr << 1);
	slaveAddr &= ~(1 << 0);		//r/nw bit
	pI2Cx->DR = slaveAddr;
}

/* ****************************************************************************************
* @fn 				- I2C_ExecuteAddressPhaseRead
*
* @breif			-
*
* @param[in]		-
* @param[in]		-
* @param[in]		-
*
* @return			- none
*
* @note				- none
**/
static void I2C_ExecuteAddressPhaseRead(I2C_RegDef_t *pI2Cx, uint8_t slaveAddr)
{
	slaveAddr |= (slaveAddr << 1);
	slaveAddr |= (1 << 0);		//r/nw bit
	pI2Cx->DR = slaveAddr;
}

/* ****************************************************************************************
* @fn 				- I2C_Generate_Start_condition
*
* @breif			-
*
* @param[in]		-
* @param[in]		-
* @param[in]		-
*
* @return			- none
*
* @note				- none
**/
static void I2C_clear_addr_flag(I2C_Handle_t *pI2CHandle)
{
	/* read sr1 and sr2 */
	uint16_t dummy_read;

	//check for device mode
	if(pI2CHandle->pI2Cx->SR2 & (1 << I2C_SR2_MSL)) {
		//device is in master mode
		if(pI2CHandle->TxRxState == I2C_BUSY_IN_RX) {
			if(pI2CHandle->RxSize == 1) {
				//first disable ACK
				I2C_ManageAcking(pI2CHandle->pI2Cx, I2C_ACK_DISABLE);

				//clear the ADDR flag
				dummy_read = pI2CHandle->pI2Cx->SR1;
				dummy_read = pI2CHandle->pI2Cx->SR2;
				(void)dummy_read;
			}
		}
		else {
			// Not busy in RX
			//clear the ADDR flag
			dummy_read = pI2CHandle->pI2Cx->SR1;
			dummy_read = pI2CHandle->pI2Cx->SR2;
			(void)dummy_read;
		}
	}
	else {
		// device is in slave mode
		//clear the ADDR flag
		dummy_read = pI2CHandle->pI2Cx->SR1;
		dummy_read = pI2CHandle->pI2Cx->SR2;
		(void)dummy_read;
	}

}

/* ****************************************************************************************
* @fn 				- I2C_Generate_Stop_condition
*
* @breif			-
*
* @param[in]		-
* @param[in]		-
* @param[in]		-
*
* @return			- none
*
* @note				- none
**/
void I2C_Generate_Stop_condition(I2C_RegDef_t *pI2Cx)
{
	pI2Cx->CR1 |= (1 << I2C_CR1_STOP);
}

/* ****************************************************************************************
* @fn 				- I2C_CloseReceive_Data
*
* @breif			-
*
* @param[in]		-
* @param[in]		-
* @param[in]		-
*
* @return			- none
*
* @note				- none
**/
void I2C_CloseReceive_Data(I2C_Handle_t *pI2CHandle)
{
	//Implement the code to disable ITBUFEN Control bit
	pI2CHandle->pI2Cx->CR2 &= ~(1 << I2C_CR2_ITBUFEN);

	//Implement the code to disable ITEVFEN control bit
	pI2CHandle->pI2Cx->CR2 &= ~(1 << I2C_CR2_ITEVTEN);

	pI2CHandle->TxRxState = I2C_READY;
	pI2CHandle->pRxBuffer = NULL;
	pI2CHandle->RxLen = 0;
	pI2CHandle->RxSize = 0;
	if(pI2CHandle->I2C_Config.I2C_ACKControl == I2C_ACK_ENABLE){
		I2C_ManageAcking(pI2CHandle->pI2Cx, I2C_ACK_ENABLE);
	}
}

/* ****************************************************************************************
* @fn 				- I2C_CloseSendData
*
* @breif			-
*
* @param[in]		-
* @param[in]		-
* @param[in]		-
*
* @return			- none
*
* @note				- none
**/
void I2C_CloseSendData(I2C_Handle_t *pI2CHandle)
{
	//Implement the code to disable ITBUFEN Control bit
	pI2CHandle->pI2Cx->CR2 &= ~(1 << I2C_CR2_ITBUFEN);

	//Implement the code to disable ITEVFEN control bit
	pI2CHandle->pI2Cx->CR2 &= ~(1 << I2C_CR2_ITEVTEN);

	pI2CHandle->TxRxState = I2C_READY;
	pI2CHandle->pTxBuffer = NULL;
	pI2CHandle->TxLen = 0;
	// Why ack enable is not required in closesenddata
	/*
	if(pI2CHandle->I2C_Config.I2C_ACKControl == I2C_ACK_ENABLE){
		I2C_ManageAcking(pI2CHandle->pI2Cx, I2C_ACK_ENABLE);
	}*/
}

/*
 * DRIVER API's
 */

/* ****************************************************************************************
* @fn 				- I2Cx_clk_control
*
* @breif			- Peripheral clock enable disable
*
* @param[in]		-
* @param[in]		-
* @param[in]		-
*
* @return			- none
*
* @note				- none
**/
void I2Cx_clk_control(I2C_RegDef_t *pI2Cx, uint8_t EnorDi)
{
	if(EnorDi == ENABLE) {
		if(pI2Cx == I2C1) {
			I2C1_CLK_EN();
		}else if(pI2Cx == I2C2) {
			I2C2_CLK_EN();
		}else if(pI2Cx == I2C3) {
			I2C3_CLK_EN();
		}
	}else if(EnorDi == DISABLE) {
		if(pI2Cx == I2C1) {
			I2C1_CLK_DI();
		}else if(pI2Cx == I2C2) {
			I2C2_CLK_DI();
		}else if(pI2Cx == I2C3) {
			I2C3_CLK_DI();
		}
	} else {
		/* error invalid param */
	}
}

/* ****************************************************************************************
* @fn 				- I2Cx_Init
*
* @breif			-
*
* @param[in]		-
* @param[in]		-
* @param[in]		-
*
* @return			- none
*
* @note				- none
**/
void I2Cx_Init(I2C_Handle_t *pI2CHandle)
{
	// 1. configure the mode (standard or fast)
	// 2. configure the speed of serial clock
	// 3. configure the device address (in slave mode only)
	// 4. Enable acking
	// 5. configure the rise time for i2c pins (for scl and sda)
	// rise time: time taken to reach from ground level to vcc or slew rate, this must be configured according to specification

	// All above configuration must be done when the peripheral is disabled in the control register
	uint32_t tempreg = 0;

	// enable the clock for i2cx peripheral
	I2Cx_clk_control(pI2CHandle->pI2Cx, ENABLE);

	// ACK control bit
	tempreg |= (pI2CHandle->I2C_Config.I2C_ACKControl << I2C_CR1_ACK);
	pI2CHandle->pI2Cx->CR1 = tempreg;

	// configure FREQ field in CR2
	tempreg = 0;
	tempreg |= RCC_GetPCLK1Value() / 1000000u;
	pI2CHandle->pI2Cx->CR2 = (tempreg & 0x3f);

	//program the device own address, assuming it is always 7 bit address
	tempreg = pI2CHandle->I2C_Config.I2C_DeviceAddress << 1;
	tempreg |= (1 << 14);	// as per manual
	pI2CHandle->pI2Cx->OAR1 |= tempreg;

