vinaib/arm_asm/m/st/STM32CubeIDE 1.2.0_Workspace/006_STM32F446RE_DRIVERS/Drivers/src/stm32f446re_i2c.c
	// ccr calculations
	uint16_t ccr_value = 0;
	tempreg = 0;
	if(pI2CHandle->I2C_Config.I2C_SCLSpeed <= I2C_SCK_SPEED_SM) {
		ccr_value = RCC_GetPCLK1Value() / (2 * pI2CHandle->I2C_Config.I2C_SCLSpeed);
		tempreg |= ccr_value & 0xFFF;
	} else {
		// set fast mode
		tempreg |= (1 << 15);
		tempreg |= (pI2CHandle->I2C_Config.I2C_FMDutyCycle << 14);
		if(pI2CHandle->I2C_Config.I2C_FMDutyCycle == I2C_FM_DUTY_2) {
			ccr_value |= RCC_GetPCLK1Value() / ( 3 * pI2CHandle->I2C_Config.I2C_SCLSpeed);
		} else {
			ccr_value |= RCC_GetPCLK1Value() / ( 25 * pI2CHandle->I2C_Config.I2C_SCLSpeed);
		}
		tempreg |= (ccr_value & 0xFFF);
	}

	pI2CHandle->pI2Cx->CCR = tempreg;

	//TRISE configuration
	if(pI2CHandle->I2C_Config.I2C_SCLSpeed <= I2C_SCK_SPEED_SM) {
		tempreg = (RCC_GetPCLK1Value() /1000000U) + 1;
	} else {
		tempreg = ((RCC_GetPCLK1Value() * 300) /1000000000U) + 1;
	}

	pI2CHandle->pI2Cx->TRISE = (tempreg & 0x3F);

}

/* ****************************************************************************************
* @fn 				- I2Cx_DeInit
*
* @breif			- Peripheral clock enable disable
*
* @param[in]		-
* @param[in]		-
* @param[in]		-
*
* @return			- none
*
* @note				- none
**/
void I2Cx_DeInit(I2C_RegDef_t *pI2Cx)
{
	if(pI2Cx == I2C1) {
		I2C1_REG_RESET();
	}else if(pI2Cx == I2C2) {
		I2C2_REG_RESET();
	}else if(pI2Cx == I2C3) {
		I2C3_REG_RESET();
	}
}

/* ****************************************************************************************
* @fn 				- I2Cx_IRQInterruptConfig
*
* @breif			-
*
* @param[in]		-
* @param[in]		-
* @param[in]		-
*
* @return			- none
*
* @note				- none
**/
void I2Cx_IRQInterruptConfig(uint8_t IRQNumber, uint8_t EnorDi)
{
	if(EnorDi == ENABLE) {
		if(IRQNumber <= 31) {		//0 to 31
			//Program ISER0 register
			*(NVIC_ISER0) |= (1 << IRQNumber);
		}else if(IRQNumber > 31 && IRQNumber < 64) {	//32 to 63
			//Program ISER1 register
			*(NVIC_ISER1) |= (1 << (IRQNumber %32));
		}else if(IRQNumber >=64  && IRQNumber < 96) {	//64 to 95
			//Program ISER2 register
			*(NVIC_ISER2) |= (1 << (IRQNumber %64));
		}
	} else {
		if(IRQNumber <= 31) {		//0 to 31
			//Program ICER0 register
			*(NVIC_ICER0) |= (1 << IRQNumber);
		}else if(IRQNumber > 31 && IRQNumber < 64) {	//32 to 63
			//Program ICER1 register
			*(NVIC_ICER1) |= (1 << (IRQNumber %32));
		}else if(IRQNumber >=64  && IRQNumber < 96) {	//64 to 95
			//Program ICSER2 register
			*(NVIC_ICER2) |= (1 << (IRQNumber %64));
		}
	}
}

/* ****************************************************************************************
* @fn 				- I2Cx_IRQPriorityConfig
*
* @breif			-
*
* @param[in]		-
* @param[in]		-
* @param[in]		-
*
* @return			- none
*
* @note				- none
**/
void I2Cx_IRQPriorityConfig(uint8_t IRQNumber, uint8_t IRQPriority)
{
	//1. first let find out the ipr register
	uint8_t iprx = IRQNumber / 4;
	uint8_t iprx_section = IRQNumber % 4;

	uint8_t shift_amount = (8 * iprx_section) + (8 - NO_PR_BITS_IMPLEMENTED);

	*(NVIC_PR_BASE_ADDR + iprx) |= (uint32_t)(IRQPriority << shift_amount);
}

/* ****************************************************************************************
* @fn 				- I2Cx_peripheral_control
*
* @breif			-
*
* @param[in]		-
* @param[in]		-
* @param[in]		-
*
* @return			- none
*
* @note				- none
**/
void I2Cx_peripheral_control(I2C_RegDef_t *pI2Cx, uint8_t EnorDi)
{
	if(EnorDi == ENABLE) {
		pI2Cx->CR1 |= (1 << I2C_CR1_PE);
	} else {
		pI2Cx->CR1 &= ~(1 << I2C_CR1_PE);
	}

}

/* ****************************************************************************************
* @fn 				- I2Cx_GetFlagStatus
*
* @breif			-
*
* @param[in]		-
* @param[in]		-
* @param[in]		-
*
* @return			- none
*
* @note				- none
**/
uint8_t I2Cx_GetFlagStatus(I2C_RegDef_t *pI2Cx, uint32_t FlagName)
{
	if(pI2Cx->SR1 & FlagName)
		return FLAG_SET;

	return FLAG_RESET;
}

/* ****************************************************************************************
* @fn 				- I2C_ApplicationEventCallback
*
* @breif			-
*
* @param[in]		-
* @param[in]		-
* @param[in]		-
*
* @return			- none
*
* @note				- none
**/
__attribute__((weak)) void I2C_ApplicationEventCallback(I2C_Handle_t *pHandle, uint8_t AppEv)
{

}

/* ****************************************************************************************
* @fn 				- I2C_MasterSendData
*
* @breif			-
*
* @param[in]		-
* @param[in]		-
* @param[in]		-
*
* @return			- none
*
* @note				- none
**/
void I2C_MasterSendData(I2C_Handle_t *pI2CHandle, uint8_t *pTxBuffer, uint32_t len, uint8_t slaveAddr, uint8_t sr)
{
	// 1. Generate START condition
	I2C_Generate_Start_condition(pI2CHandle->pI2Cx);

	// 2. Confirm that start generation is completed by checking the SB flag in the SR1
	// Note: until SB is cleared SCL will be stretched (pulled to low)
	// as per RM pg:788, SB is cleared by software by reading the SR1 register followed by
	//writing the DR register, or by hardware when PE=0
	while(!I2Cx_GetFlagStatus(pI2CHandle->pI2Cx, I2C_SR1_FLAG_SB));

	// 3 send the address of the slave with r/nw bit set to w(0)
	I2C_ExecuteAddressPhaseWrite(pI2CHandle->pI2Cx, slaveAddr);

	// 4. wait until address phase is completed by checking the ADDR flag in the SR1
	while(!I2Cx_GetFlagStatus(pI2CHandle->pI2Cx, I2C_SR1_FLAG_ADDR));

	// 5. clear the ADDR flag according to its software sequence
	// note until ADDR is cleared SCL will be stretched (pulled to low)
	I2C_clear_addr_flag(pI2CHandle);

	// 6. send the data until len becomes 0
	while(len > 0) {
		// wait till TXE is set
		while(!I2Cx_GetFlagStatus(pI2CHandle->pI2Cx, I2C_SR1_FLAG_TXE));
		pI2CHandle->pI2Cx->DR = *pTxBuffer;
		pTxBuffer++;
		len--;
	}

	// 7. when len becomes 0, wait for TXE=1 and BTF=1 before generating the STOP condition
	// note: TXE=1,  BTF=1 means that both SR and DR are empty and next transmission should begin
	// when BTF=1 SCL will be stretched (pulled to LOW)
	while(!I2Cx_GetFlagStatus(pI2CHandle->pI2Cx, I2C_SR1_FLAG_TXE));

	while(!I2Cx_GetFlagStatus(pI2CHandle->pI2Cx, I2C_SR1_FLAG_BTF));

	// 8. Generate STOP condition and master need not wait for the completion of stop condition
	// Note: generating stop, automatically clears the BTF
	if(sr == I2C_DISABLE_SR) {
		I2C_Generate_Stop_condition(pI2CHandle->pI2Cx);
	}
}

/* ****************************************************************************************
* @fn 				- I2C_MasterReceiveData
*
* @breif			-
*
* @param[in]		-
* @param[in]		-
* @param[in]		-
*
* @return			- none
*
* @note				- none
**/
void I2C_MasterReceiveData(I2C_Handle_t *pI2CHandle, uint8_t *pRxBuffer, uint32_t len, uint8_t slaveAddr, uint8_t sr)
{
	//1. Generate Start condition
	I2C_Generate_Start_condition(pI2CHandle->pI2Cx);

	//2. confirm that start generation is completed by checking the SB flag in the SR1
	// Note. Until SB is cleared SCL will be stretched (pulled to low)
	while(!I2Cx_GetFlagStatus(pI2CHandle->pI2Cx, I2C_SR1_FLAG_SB));

	//3.send the address of the slave with r/nw bit set to Rd(1)
	I2C_ExecuteAddressPhaseRead(pI2CHandle->pI2Cx, slaveAddr);

	// 4. wait until address phase is completed by checking the ADDR flag in the SR1
	while(!I2Cx_GetFlagStatus(pI2CHandle->pI2Cx, I2C_SR1_FLAG_ADDR));

	//Procedure to read only 1 byte from slave
	if(len == 1) {
		// Disable ACK
		I2C_ManageAcking(pI2CHandle->pI2Cx, I2C_ACK_DISABLE);

		// generate stop condition
		if(sr == I2C_DISABLE_SR) {
			I2C_Generate_Stop_condition(pI2CHandle->pI2Cx);
		}

		// clear the addr flag
		I2C_clear_addr_flag(pI2CHandle);

		// wait until RXNE becomes 1
		while(!I2Cx_GetFlagStatus(pI2CHandle->pI2Cx, I2C_SR1_FLAG_RXNE));

		// read data in to buffer
		*pRxBuffer = pI2CHandle->pI2Cx->DR;
	}

	//procedure to read data from slave when len > 1
	if(len > 1) {
		// clear the addr flag
		I2C_clear_addr_flag(pI2CHandle);

		// read the data until len becomes zero
		for(uint32_t i = len; i>0; i--) {
			// wait until RXNE becomes 1
			while(!I2Cx_GetFlagStatus(pI2CHandle->pI2Cx, I2C_SR1_FLAG_RXNE));

