vinaib/arm_asm/m/st/STM32CubeIDE 1.2.0_Workspace/006_STM32F446RE_DRIVERS/Drivers/src/stm32f446re_i2c.c
			// if last 2 bytes are remaining
			if(i==2) {
				// Disable ACK
				I2C_ManageAcking(pI2CHandle->pI2Cx, I2C_ACK_DISABLE);

				// generate stop condition
				if(sr == I2C_DISABLE_SR) {
					I2C_Generate_Stop_condition(pI2CHandle->pI2Cx);
				}
			}
			// read the data from data register in to buffer
			*pRxBuffer = pI2CHandle->pI2Cx->DR;

			// increment the buffer address
			pRxBuffer++;
		}
	}

	// re-enable ack
	if(pI2CHandle->I2C_Config.I2C_ACKControl == I2C_ACK_ENABLE) {
		I2C_ManageAcking(pI2CHandle->pI2Cx, I2C_ACK_ENABLE);
	}
}

/* ****************************************************************************************
* @fn 				- I2C_ManageAcking
*
* @breif			-
*
* @param[in]		-
* @param[in]		-
* @param[in]		-
*
* @return			- none
*
* @note				- none
**/
void I2C_ManageAcking(I2C_RegDef_t *pI2Cx, uint8_t EnorDi)
{
	if(EnorDi == I2C_ACK_ENABLE) {
		pI2Cx->CR1 |= (I2C_ACK_ENABLE << I2C_CR1_ACK);
	} else {
		pI2Cx->CR1 &= ~(I2C_ACK_ENABLE << I2C_CR1_ACK);
	}
}

/* ****************************************************************************************
* @fn 				- I2C_MasterSendDataIT
*
* @breif			-
*
* @param[in]		-
* @param[in]		-
* @param[in]		-
*
* @return			- none
*
* @note				- none
**/
uint8_t I2C_MasterSendDataIT(I2C_Handle_t *pI2CHandle, uint8_t *pTxBuffer, uint32_t len, uint8_t slaveAddr, uint8_t sr)
{
	uint8_t busystate = pI2CHandle->TxRxState;

	if( (busystate != I2C_BUSY_IN_TX) && (busystate != I2C_BUSY_IN_RX))
	{
		pI2CHandle->pTxBuffer = pTxBuffer;
		pI2CHandle->TxLen = len;
		pI2CHandle->TxRxState = I2C_BUSY_IN_TX;
		pI2CHandle->DevAddr = slaveAddr;
		pI2CHandle->Sr = sr;

		//Implement code to Generate START Condition
		I2C_Generate_Start_condition(pI2CHandle->pI2Cx);

		//Implement the code to enable ITBUFEN Control Bit
		pI2CHandle->pI2Cx->CR2 |= ( 1 << I2C_CR2_ITBUFEN);

		//Implement the code to enable ITEVFEN Control Bit
		pI2CHandle->pI2Cx->CR2 |= ( 1 << I2C_CR2_ITEVTEN);

		//Implement the code to enable ITERREN Control Bit
		pI2CHandle->pI2Cx->CR2 |= ( 1 << I2C_CR2_ITERREN);


	}

	return busystate;

}

/* ****************************************************************************************
* @fn 				- I2C_MasterReceiveDataIT
*
* @breif			-
*
* @param[in]		-
* @param[in]		-
* @param[in]		-
*
* @return			- none
*
* @note				- none
**/
uint8_t I2C_MasterReceiveDataIT(I2C_Handle_t *pI2CHandle, uint8_t *pRxBuffer, uint32_t len, uint8_t slaveAddr, uint8_t sr)
{

	uint8_t busystate = pI2CHandle->TxRxState;

	if( (busystate != I2C_BUSY_IN_TX) && (busystate != I2C_BUSY_IN_RX))
	{
		pI2CHandle->pRxBuffer = pRxBuffer;
		pI2CHandle->RxLen = len;
		pI2CHandle->TxRxState = I2C_BUSY_IN_RX;
		pI2CHandle->RxSize = len; //Rxsize is used in the ISR code to manage the data reception
		pI2CHandle->DevAddr = slaveAddr;
		pI2CHandle->Sr = sr;

		//Implement code to Generate START Condition
		I2C_Generate_Start_condition(pI2CHandle->pI2Cx);

		//Implement the code to enable ITBUFEN Control Bit
		pI2CHandle->pI2Cx->CR2 |= ( 1 << I2C_CR2_ITBUFEN);

		//Implement the code to enable ITEVFEN Control Bit
		pI2CHandle->pI2Cx->CR2 |= ( 1 << I2C_CR2_ITEVTEN);

		//Implement the code to enable ITERREN Control Bit
		pI2CHandle->pI2Cx->CR2 |= ( 1 << I2C_CR2_ITERREN);
	}

	return busystate;
}

/* ****************************************************************************************
* @fn 				- I2C_SlaveSendData
*
* @breif			-
*
* @param[in]		-
* @param[in]		-
* @param[in]		-
*
* @return			- none
*
* @note				- none
**/
void I2C_SlaveSendData(I2C_RegDef_t *pI2C, uint8_t data)
{
	pI2C->DR = data;
}

/* ****************************************************************************************
* @fn 				- I2C_SlaveReceiveData
*
* @breif			-
*
* @param[in]		-
* @param[in]		-
* @param[in]		-
*
* @return			- none
*
* @note				- none
**/
uint8_t I2C_SlaveReceiveData(I2C_RegDef_t *pI2C)
{
	return (uint8_t)pI2C->DR;
}

/* ****************************************************************************************
* @fn 				- I2C_EV_IRQHandling
*
* @breif			-
*
* @param[in]		-
* @param[in]		-
* @param[in]		-
*
* @return			- none
*
* @note				- none
**/
void I2C_EV_IRQHandling(I2C_Handle_t *pI2CHandle)
{
	// interrupt handling for both master and slave mode of device
	uint32_t temp1, temp2, temp3;

	temp1 = pI2CHandle->pI2Cx->CR2 & (1 << I2C_CR2_ITEVTEN);
	temp2 = pI2CHandle->pI2Cx->CR2 & (1 << I2C_CR2_ITBUFEN);

	temp3 = pI2CHandle->pI2Cx->SR1 & (1 << I2C_SR1_FLAG_SB);
	// 1. Handle for interrupt generated by SB event
	// Note: SB flag is only applicable in master mode not in slave mode
	if(temp1 && temp3) {
		// Interrupt is generated because of SB event
		// In this block execute the next phase, i.e. address phase
		if(pI2CHandle->TxRxState == I2C_BUSY_IN_TX) {
			I2C_ExecuteAddressPhaseWrite(pI2CHandle->pI2Cx, pI2CHandle->DevAddr);
		}
		else if(pI2CHandle->TxRxState == I2C_BUSY_IN_RX) {
			I2C_ExecuteAddressPhaseRead(pI2CHandle->pI2Cx, pI2CHandle->DevAddr);
		}
	}

	temp3 = pI2CHandle->pI2Cx->SR1 & (I2C_SR1_FLAG_ADDR);
	// 2. Handle for interrupt generated by ADDR event
	// Note: When master mode: Address is sent
	// When slave mode address is matched with own address
	if(temp1 && temp3) {
		// Interrupt is generated by ADDR event, clear the ADDR flag
		I2C_clear_addr_flag(pI2CHandle);
	}

	temp3 = pI2CHandle->pI2Cx->SR1 & (I2C_SR1_FLAG_BTF);
	// 3. Handle for interrupt generated by BTF (Byte Transfer Finished event)
	// when BTF flag is set:
	// Case TXE = 1
	//		Shift Register (SR) and Data Register (DR)  are empty
	// Case RXNE = 1
	//	SR and DR are full
	if(temp1 && temp3) {
		// BTF flag is set
		if(pI2CHandle->TxRxState == I2C_BUSY_IN_TX) {
			// make sure that TXE is also set
			if(pI2CHandle->pI2Cx->SR1 & (I2C_SR1_FLAG_TXE)) {
				// BTF and TXE are 1
				if(pI2CHandle->TxLen == 0) {
					//1. Generate stop the condition
					if(pI2CHandle->Sr == I2C_DISABLE_SR) {
						I2C_Generate_Stop_condition(pI2CHandle->pI2Cx);
					}

					//2. reset all the member elements of the Handle structure
					I2C_CloseSendData(pI2CHandle);

