vinaib/arm_asm/m/st/STM32CubeIDE 1.2.0_Workspace/006_STM32F446RE_DRIVERS/Drivers/src/stm32f446re_i2c.c
					//3. notify the application about transmission complete
					I2C_ApplicationEventCallback(pI2CHandle, I2C_EV_TX_CMPLT);
				}
			}

		}
		else if(pI2CHandle->TxRxState == I2C_BUSY_IN_RX) {
			;
		}
	}

	temp3 = pI2CHandle->pI2Cx->SR1 & (I2C_SR1_FLAG_STOPF);
	// 4. Handle for interrupt generated by STOPF event
	// Note: Stop Detection flag is applicable only in slave mode. For master this flag will never be set
	// below code block will not be executed by the master since STOPF will not set in master mode
	if(temp1 && temp3) {
		// STOPF flag is set
		// Clear the STOPF (i.e read SR1 and write to CR1)
		//Read is done above, and with STOPF flag
		// write to CR1, do not write anything which is not valid
		pI2CHandle->pI2Cx->CR1 |= 0x0000;

		//Notify the application that STOP is detected
		I2C_ApplicationEventCallback(pI2CHandle, I2C_EV_STOP);
	}

	temp3 = pI2CHandle->pI2Cx->SR1 & (I2C_SR1_FLAG_TXE);
	// 5. Handle for interrupt generated by TXE event
	if(temp1 && temp2 && temp3) {

		// check for device mode, execute following only when device is in master mode
		if(pI2CHandle->pI2Cx->SR2 & (I2C_SR2_FLAG_MSL)) {

			// TXE flag is set
			// we have to do the data transmission
			if(pI2CHandle->TxRxState == I2C_BUSY_IN_TX) {

				if(pI2CHandle->TxLen > 0) {
					// 1. Load the data in to DR
					pI2CHandle->pI2Cx->DR = *(pI2CHandle->pTxBuffer);

					// 2. Decrement the TxLen
					pI2CHandle->TxLen--;

					// 3. Increment the buffer address
					pI2CHandle->pTxBuffer++;
				}
			}
		}
		else {
			// Slave mode
			if(pI2CHandle->pI2Cx->SR2 & (1 << I2C_SR2_TRA)) {
				I2C_ApplicationEventCallback(pI2CHandle, I2C_EV_DATA_REQ);
			}
		}
	}

	temp3 = pI2CHandle->pI2Cx->SR1 & (I2C_SR1_FLAG_RXNE);
	// 6. Handle for interrupt generated by RXNE event
	if(temp1 && temp2 && temp3) {
		// RXNE flag is set
		// check for device mode, execute following only when device is in master mode
		if(pI2CHandle->pI2Cx->SR2 & (I2C_SR2_FLAG_MSL)) {

			// Do only when application is in Busy in Rx
			if(pI2CHandle->TxRxState == I2C_BUSY_IN_RX) {
				// we have to do the data reception
				if(pI2CHandle->RxSize == 1) {
					*pI2CHandle->pRxBuffer = pI2CHandle->pI2Cx->DR;
					pI2CHandle->RxLen--;
				}

				if(pI2CHandle->RxSize > 1) {
					if(pI2CHandle->RxLen == 2) {
						// clear the ack bit
						I2C_ManageAcking(pI2CHandle->pI2Cx, I2C_ACK_DISABLE);
					}

					//read DR
					*pI2CHandle->pRxBuffer = pI2CHandle->pI2Cx->DR;
					pI2CHandle->pRxBuffer++;
					pI2CHandle->RxLen--;
				}

				if(pI2CHandle->RxLen == 0) {
					// Close the I2C Data reception and notify the application

					// 1. generate the stop condition
					if(pI2CHandle->Sr == I2C_DISABLE_SR) {
						I2C_Generate_Stop_condition(pI2CHandle->pI2Cx);
					}

					// 2. Close the I2C rx
					I2C_CloseReceive_Data(pI2CHandle);

					// 3. Notify the application
					I2C_ApplicationEventCallback(pI2CHandle, I2C_EV_RX_CMPLT);
				}
			}
		}
		else {
			// Slave mode
			if(pI2CHandle->pI2Cx->SR2 & (1 << I2C_SR2_TRA)) {
				I2C_ApplicationEventCallback(pI2CHandle, I2C_EV_DATA_RCV);
			}

		}
	}

}

/* ****************************************************************************************
* @fn 				- I2C_ER_IRQHandling
*
* @breif			-
*
* @param[in]		-
* @param[in]		-
* @param[in]		-
*
* @return			- none
*
* @Note              - Complete the code also define these macros in the driver
**/
void I2C_ER_IRQHandling(I2C_Handle_t *pI2CHandle)
{
	uint32_t temp1,temp2;

    //Know the status of  ITERREN control bit in the CR2
	temp2 = (pI2CHandle->pI2Cx->CR2) & ( 1 << I2C_CR2_ITERREN);


/***********************Check for Bus error************************************/
	temp1 = (pI2CHandle->pI2Cx->SR1) & ( 1<< I2C_SR1_BERR);
	if(temp1  && temp2 )
	{
		//This is Bus error

		//Implement the code to clear the buss error flag
		pI2CHandle->pI2Cx->SR1 &= ~( 1 << I2C_SR1_BERR);

		//Implement the code to notify the application about the error
	   I2C_ApplicationEventCallback(pI2CHandle,I2C_ERROR_BERR);
	}

/***********************Check for arbitration lost error************************************/
	temp1 = (pI2CHandle->pI2Cx->SR1) & ( 1 << I2C_SR1_ARLO );
	if(temp1  && temp2)
	{
		//This is arbitration lost error

		//Implement the code to clear the arbitration lost error flag
		pI2CHandle->pI2Cx->SR1 &= ~( 1 << I2C_SR1_ARLO);

		//Implement the code to notify the application about the error
		I2C_ApplicationEventCallback(pI2CHandle,I2C_ERROR_ARLO);

	}

/***********************Check for ACK failure  error************************************/

	temp1 = (pI2CHandle->pI2Cx->SR1) & ( 1 << I2C_SR1_AF);
	if(temp1  && temp2)
	{
		//This is ACK failure error

	    //Implement the code to clear the ACK failure error flag
		pI2CHandle->pI2Cx->SR1 &= ~( 1 << I2C_SR1_AF);

		//Implement the code to notify the application about the error
		I2C_ApplicationEventCallback(pI2CHandle,I2C_ERROR_AF);
	}

/***********************Check for Overrun/underrun error************************************/
	temp1 = (pI2CHandle->pI2Cx->SR1) & ( 1 << I2C_SR1_OVR);
	if(temp1  && temp2)
	{
		//This is Overrun/underrun

	    //Implement the code to clear the Overrun/underrun error flag
		pI2CHandle->pI2Cx->SR1 &= ~( 1 << I2C_SR1_OVR);

		//Implement the code to notify the application about the error
		I2C_ApplicationEventCallback(pI2CHandle,I2C_ERROR_OVR);
	}

/***********************Check for Time out error************************************/
	temp1 = (pI2CHandle->pI2Cx->SR1) & ( 1 << I2C_SR1_TIMEOUT);
	if(temp1  && temp2)
	{
		//This is Time out error

	    //Implement the code to clear the Time out error flag
		pI2CHandle->pI2Cx->SR1 &= ~( 1 << I2C_SR1_TIMEOUT);

		//Implement the code to notify the application about the error
		I2C_ApplicationEventCallback(pI2CHandle,I2C_ERROR_TIMEOUT);
	}
}
